app/views/users/index.html.erb

      <p>
        <%= user.ribbitts.length %> Ribbits
---
SELECT "ribbitts".* FROM "ribbitts"  WHERE "ribbitts"."user_id" = ?  ORDER BY created_at DESC  [["user_id", 1]]