app/views/users/show.html.erb

SELECT "ribbitts".* FROM "ribbitts"  WHERE "ribbitts"."user_id" = ?  ORDER BY created_at DESC  [["user_id", 3]]
---
    <p>
      <%= @user.ribbitts.length %> Ribbits