app/controllers/relationships_controller.rb

INSERT INTO "relationships" ("created_at", "followed_id", "follower_id", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", "2014-06-02 17:26:18.974881"], ["followed_id", 1], ["follower_id", 3], ["updated_at", "2014-06-02 17:26:18.974881"]]
---
  def create
    relationship = Relationship.new(relationship_params)
    relationship.follower = current_user

    flash[:error] = "Couldn't follow" unless relationship.save

SELECT  "relationships".* FROM "relationships"  WHERE "relationships"."id" = ? LIMIT 1  [["id", 1]]
DELETE FROM "relationships" WHERE "relationships"."id" = ?  [["id", 1]]
---
  def destroy
    relationship = Relationship.find(params[:id])
    user = relationship.followed
    relationship.destroy