app/controllers/ribbitts_controller.rb

  def index
    @ribbits = Ribbitt.all
---
SELECT "ribbitts".* FROM "ribbitts"   ORDER BY created_at DESC

  def create
    ribbit = Ribbitt.new(ribbitts_params)
    ribbit.user_id = current_user.id

    flash[:error] = "Your Ribbit was over 140 characters" unless ribbit.save
---
INSERT INTO "ribbitts" ("content", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?)  [["content", "3rd ribit"], ["created_at", "2014-05-30 19:22:18.732176"], ["updated_at", "2014-05-30 19:22:18.732176"], ["user_id", 3]]