app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)
    if @user.save
---
INSERT INTO "users" ("avatar_url", "created_at", "email", "name", "password_digest", "updated_at", "username") VALUES (?, ?, ?, ?, ?, ?, ?)

  def buddies
    if current_user
      @ribbit = Ribbitt.new
      puts YAML::dump(@ribbit)
      buddies_ids = current_user.followeds.map(&:id).push(current_user.id)


      @ribbits = Ribbitt.find_by(user_id: buddies_ids)
---
SELECT  "ribbitts".* FROM "ribbitts"  WHERE "ribbitts"."user_id" IN (3)  ORDER BY created_at DESC LIMIT 1

  def show
    @user= User.find(params[:id])
    @ribbit = Ribbitt.new
    @relationship = Relationship.where(
       follower_id: current_user.id,
       followed_id: @user.id
    ).first_or_initialize if current_user
---
SELECT  "users".* FROM "users"  WHERE "users"."id" = ? LIMIT 1  [["id", 3]]
SELECT  "relationships".* FROM "relationships"  WHERE "relationships"."follower_id" = 3 AND "relationships"."followed_id" = 1  ORDER BY "relationships"."id" ASC LIMIT 1